package софия.ту.модел;

import javax.persistence.*;

/**
 * Класът съдържа информацията за обекта съобщение. Той е репрезентация на
 * таблица Съобщения в базата данни.
 *
 * @author Иван Колев
 */
@Entity
@Table(name = "chatmessages")
public class ЧатСъобщение {

    @Id
    @GeneratedValue(strategy = GenerationType.AUTO)
    private Long ид;

    /**
     * Името на получателя на съобщение.
     */
    private String получател;

    /**
     * Името на изпращача на съобщение.
     */
    private String изпращач;

    /**
     * Садържанието на съобщението.
     */
    private String съдържание;

    /**
     * @return Връща името на получателя на съобщението.
     */
    public String вземиПолучател() {
	return получател;
    }

    /**
     * Запазва името на получателя на съобщението.
     */
    public void запазиПолучател(String получател) {
	this.получател = получател;
    }

    /**
     * @return Връща името на изпращача на съобщението.
     */
    public String вземиИзпращач() {
	return изпращач;
    }

    /**
     * Запазва името на изпращача на съобщението.
     */
    public void запазиИзпращач(String изпращач) {
	this.изпращач = изпращач;
    }

    /**
     * @return Връща съдържанието на съобщението.
     */
    public String вземиСъобщение() {
	return съдържание;
    }

    /**
     * Запазва съдържание на съобщението.
     */
    public void запазиСъобщение(String съдържание) {
	this.съдържание = съдържание;
    }
}
