package софия.ту.хранилище;

import org.springframework.data.jpa.repository.JpaRepository;

import софия.ту.модел.Потребител;

/**
 * Предоставя методи, които могат да бъдат използвани за извличане, добавяне, изтриване и
 * модифициране на информация, сързана с потребителските роли. Която се съхранява в базата
 * данни.
 * 
 * @author Иван Колев
 *
 */
public interface ХранилищеПотребители extends JpaRepository<Потребител, Long> {
    Потребител търсиПоПотребителскоИме(String потребителскоИме);
}
