package софия.ту.сървис;

/**
 * Предоставя възможности за откриване на текущия потребител и автоматичното му
 * логване.
 * 
 * @author Иван Колев
 *
 */
public interface СървисСигурност {

    /**
     * Връща името на теущият потребител.
     * 
     * @return потребителско име
     */
    String намериИметоНаТекущиятПотребител();

    /**
     * Извършва автоматично логване, по подадени потребителско име и парола.
     * 
     * @param потребителскоИме
     * @param парола
     */
    void автоЛогване(String потребителскоИме, String парола);
}
