package софия.ту.сървис;

import софия.ту.модел.Потребител;

/**
 * Предоставя методи за добавяне на нови пртребители в системата и за вход на
 * вече съществуващи такива.
 * 
 * @author Иван Колев
 *
 */
public interface СървисПотребители {

    /**
     * Иницира запазване на информация за нов потребител в базата данни.
     * 
     * @param потребител
     */
    void запази(Потребител потребител);

    /**
     * Връща информация за потребител по дадено потребителско име.
     * 
     * @param потребителскоИме
     * @return
     */
    Потребител намериПоИме(String потребителскоИме);
}
